app/views/movies/index.html.erb

    <tr>
        <%= class="<%= 'p-3 mb-2 bg-warning' if params[:sorted_title] == "1" %>", link_to "Movie Title", movies_path(:sort => "title_sort", :ratings => Hash[@ratings_to_show.map {|x| [x, 1]}]), :id => "title_header", class:'hilite'%>
---
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG'))  ORDER BY "movies"."title" ASC