app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13','R'))
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG'))  ORDER BY "movies"."title" ASC
---
  def index
    @all_ratings = Movie.return_ratings
    @movies = Movie.all
    @ratings_to_show = @all_ratings

    unless params[:ratings].nil?
      @ratings_to_show = Movie.checked_ratings(params[:ratings])
      session[:ratings_to_show] = @ratings_to_show
    end

    if params[:ratings].nil? && session[:ratings_to_show]
      @ratings_to_show = session[:ratings_to_show]
    end

    if @ratings_to_show.nil?
      @movies = Movie.all
    else
      @movies = Movie.where('rating IN (?)', @ratings_to_show)
    end

    if params[:sort]
      session[:sort] = params[:sort]
    elsif session[:sort]
      params[:sort] = session[:sort]
    else
    end

    if params[:sort]
      if params[:sort] == "title_sort"
        @movies = @movies.order(:title)